<template>
  <div>
    <svg-icon icon-class="admin" style="font-size: 36px;"></svg-icon>
  </div>
</template>
<script>
export default {
  name: 'Scroll',
  data() {
    return {
      content: ''
    };
  },
  mounted() {
    setTimeout(() => {
      this.content = `床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头
    床前明月光啊，明月光，疑是地上霜啊，举头嘿嘿`;
    });
  }
};

</script>

<style scoped lang="scss">

</style>
